CREATE TABLE students (
    id_student SERIAL PRIMARY KEY,  -- ID студента
    full_name VARCHAR(100) NOT NULL,  -- ФИО студента
    phone VARCHAR(11),  -- Телефон
    email VARCHAR(50),  -- Email
    course_ids INT[]  -- Массив с ID курсов, на которые записан студент
);

INSERT INTO students (full_name, phone, email, course_ids) VALUES
('Смирнов Сергей Васильевич', '89161234567', 'ivanov@university.com', '{1, 2}'),
('Петрова Мария Алексеевна', '89251234567', 'petrova@academy.edu', '{2, 3}'),
('Сидоров Алексей Викторович', '89321234567', 'sidorov@studmail.ru', '{1}'),
('Козлова Екатерина Михайловна', '89461234567', 'kozlova@student.org', '{1, 4}'),
('Новиков Олег Петрович', '89561234567', 'novikov@university.edu', '{3, 4}'),
('Смирнов Дмитрий Сергеевич', '89661234567', 'smirnov@college.net', '{2}'),
('Лебедева Наталья Васильевна', '89761234567', 'lebedova@university.ru', '{1, 2, 4}'),
('Кузнецова Татьяна Владимировна', '89861234567', 'kuznetsova@school.org', '{3, 4}'),
('Попова Ирина Павловна', '89961234567', 'popova@student.com', '{1}'),
('Михайлов Артем Олегович', '89171234567', 'mihaylov@college.com', '{4}'),
('Куликова Александра Андреевна', '89271234567', 'kulikova@university.ru', '{1, 3}'),
('Павлов Александр Николаевич', '89371234567', 'pavlov@university.edu', '{2, 4}'),
('Григорьев Дмитрий Андреевич', '89471234567', 'grigoryev@studmail.ru', '{1}'),
('Соколова Елена Вячеславовна', '89571234567', 'sokolova@college.edu', '{2, 3}'),
('Зайцева Наталья Анатольевна', '89671234567', 'zaytseva@academy.ru', '{1, 4}'),
('Тимофеева Алина Константиновна', '89771234567', 'timofeeva@university.org', '{2}'),
('Романова Виктория Сергеевна', '89871234567', 'romanova@student.edu', '{1, 3}'),
('Чернов Олег Михайлович', '89971234567', 'chernov@college.net', '{4}'),
('Егорова Ксения Валерьевна', '89181234567', 'egorova@school.com', '{2, 4}'),
('Борисова Ирина Павловна', '89281234567', 'borisova@academy.org', '{1}'),
('Фролова Марина Васильевна', '89381234567', 'frolova@university.net', '{3}'),
('Семенова Олеся Вячеславовна', '89481234567', 'semenova@student.ru', '{2, 3}'),
('Беляев Сергей Александрович', '89581234567', 'belyaev@university.edu', '{1, 4}'),
('Гончаров Владимир Николаевич', '89681234567', 'goncharov@college.org', '{1}'),
('Дмитриев Сергей Павлович', '89781234567', 'dmitriev@university.com', '{2, 4}'),
('Карпов Дмитрий Валерьевич', '89881234567', 'karpov@school.net', '{3}'),
('Морозова Ольга Николаевна', '89981234567', 'morozova@university.org', '{1, 2}'),
('Шмидт Екатерина Анатольевна', '89191234567', 'schmidt@academy.edu', '{2, 3}'),
('Тарасова Ирина Владимировна', '89291234567', 'tarasova@university.net', '{1}'),
('Шереметьева Виктория Павловна', '89391234567', 'sheremeteva@college.ru', '{4}'),
('Потапова Валентина Александровна', '89491234567', 'potapova@student.org', '{2, 4}'),
('Савельев Сергей Михайлович', '89591234567', 'savelyev@academy.com', '{1, 3}'),
('Колесников Дмитрий Петрович', '89691234567', 'kolesnikov@university.ru', '{4}'),
('Васильева Оксана Дмитриевна', '89791234567', 'vasilyeva@school.com', '{2}'),
('Викторова Юлия Викторовна', '89891234567', 'viktorova@student.net', '{1, 3}'),
('Гончарова Олеся Валентиновна', '89991234567', 'goncharova@college.org', '{2, 4}'),
('Степанова Ольга Александровна', '89101324567', 'stepanova@university.ru', '{1}'),
('Дорожкина Людмила Павловна', '89201324567', 'dorozhkina@college.com', '{2, 3, 4}'),
('Захарова Александра Борисовна', '89301324567', 'zaharova@academy.ru', '{2}'),
('Белова Ирина Константиновна', '89401324567', 'belova@university.com', '{1, 3, 4}'),
('Семенов Владислав Андреевич', '89501324567', 'semenov@university.net', '{3}'),
('Филиппова Екатерина Олеговна', '89601324567', 'filippova@student.org', '{2}'),
('Шатрова Ольга Вячеславовна', '89701324567', 'shatrova@university.edu', '{4}'),
('Климова Наталья Васильевна', '89801324567', 'klimova@college.org', '{1, 3}'),
('Острова Людмила Николаевна', '89901324567', 'ostrova@student.com', '{4}'),
('Гордеева Лариса Петровна', '89111324567', 'gordeva@academy.org', '{1}'),
('Мельников Александр Валерьевич', '89211324567', 'melnikov@university.net', '{3}'),
('Мишина Ольга Сергеевна', '89311324567', 'mishina@university.edu', '{2, 4}'),
('Семенова Виктория Анатольевна', '89411324567', 'semenova@college.com', '{1}'),
('Федорова Ксения Владимировна', '89511324567', 'fedorova@academy.org', '{1, 2, 3}'),
('Светлова Кристина Борисовна', '89611324567', 'svetlova@university.net', '{2, 4}'),
('Миронова Юлия Олеговна', '89711324567', 'mironova@university.com', '{1}'),
('Гусева Ирина Сергеевна', '89811324567', 'guseva@college.ru', '{2}'),
('Лазарева Оксана Вячеславовна', '89911324567', 'lazareva@academy.net', '{4}'),
('Лапина Александра Петровна', '89121324567', 'lapina@university.edu', '{1}'),
('Титов Владислав Анатольевич', '89221324567', 'tivov@school.org', '{3, 4}'),
('Голубева Ирина Николаевна', '89321324567', 'golubeva@college.com', '{2}'),
('Курочкина Лариса Александровна', '89421324567', 'kurochkina@university.org', '{1, 2, 3}'),
('Литвинова Надежда Михайловна', '89521324567', 'litvinova@academy.edu', '{4}'),
('Нестерова Валентина Михайловна', '89621324567', 'nestrova@university.ru', '{2}'),
('Яковлева Дарина Владимировна', '89721324567', 'yakovleva@school.net', '{3, 4}'),
('Жукова Валерия Олеговна', '89821324567', 'zhukova@university.edu', '{1}'),
('Зиновьева Наталья Станиславовна', '89921324567', 'zinovyeva@academy.org', '{2, 4}'),
('Ясная Ирина Дмитриевна', '89131324567', 'yasnaya@school.net', '{3}'),
('Котова Алла Сергеевна', '89231324567', 'kotova@college.com', '{2, 4}'),
('Бенешвили Нина Владимировна', '89331324567', 'beneshvili@university.edu', '{1}'),
('Чистякова Ирина Олеговна', '89431324567', 'chistyakova@college.net', '{3}'),
('Косарева Марина Анатольевна', '89531324567', 'kosareva@university.org', '{1, 3, 4}'),
('Михайлова Татьяна Борисовна', '89631324567', 'mihaylova@academy.ru', '{2}'),
('Тонкова Олеся Александровна', '89731324567', 'tonkova@school.org', '{3}'),
('Федоровна Виктория Петровна', '89831324567', 'fedorovna@university.net', '{4}'),
('Соловьева Ирина Дмитриевна', '89931324567', 'solovyeva@academy.org', '{1}'),
('Доронина Людмила Анатольевна', '89141324567', 'doronina@university.com', '{2, 4}'),
('Киселева Анастасия Павловна', '89241324567', 'kiseleva@college.edu', '{1, 3}'),
('Рудакова Валентина Александровна', '89341324567', 'rudakova@university.ru', '{2}'),
('Куликов Павел Валерьевич', '89441324567', 'kulikov@academy.com', '{1}'),
('Григорьева Нина Николаевна', '89541324567', 'grigoryeva@university.net', '{3}'),
('Петросян Марина Анатольевна', '89641324567', 'petrosyan@college.ru', '{4}'),
('Линькова Оксана Владиславовна', '89741324567', 'linkova@academy.org', '{2}'),
('Рыбкина Татьяна Дмитриевна', '89841324567', 'rybkina@university.com', '{1, 4}'),
('Широкова Анна Сергеевна', '89941324567', 'shirokova@college.edu', '{3}');


CREATE TABLE teachers (
    teacher_id SERIAL PRIMARY KEY,
    full_name VARCHAR(100),
    phone VARCHAR(11),
    email VARCHAR(50),
    course_id INTEGER
);
INSERT INTO teachers (full_name, phone, email, course_id) VALUES
('Петров Владимир Александрович', '89161234567', 'petrov@university.com', 1),
('Иванова Ольга Дмитриевна', '89261234567', 'ivanova@academy.edu', 2),
('Иванов Иван Иванович', '89361234567', 'ivanov@college.net', 3),
('Кузнецова Наталья Павловна', '89461234567', 'kuznetsova@student.org', 4);

CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    course_name VARCHAR(100)
);

INSERT INTO courses (course_id, course_name) VALUES
(1, 'Программирование на Python'),
(2, 'Алгоритмы и структуры данных'),
(3, 'Системный анализ'),
(4, 'Теория баз данных');